Repository: JudoPay/JudoKitObjC
Catalog: Resources/*.lproj/Localizable.strings
Languages: es, fr, it, nl, pt_pt

source: Billing postcode
es: Código postal
fr: Code postal de facturation
it: CAP di fatturazione
nl: Factuur postcode
pt_pt: Código Postal

source: Billing ZIP code
es: Código postal
fr: Code postal de facturation
it: ZIP code di fatturazione
nl: Factuur postcode
pt_pt: Código Postal

source: Billing postal code
es: Código postal
fr: Code postal de facturation
it: CAP di fatturazione
nl: Factuur post adres
pt_pt: Código Postal

source: Pay
es: Pagar
fr: Payer
it: Paga ora
nl: Betalen
pt_pt: Pagar

source: Payment
es: Pago
fr: Paiement
it: Pagamento
nl: Betaling
pt_pt: Pagamento

# card_number_label
source: Card number
es: Número de tarjeta
fr: Numéro de carte
it: Numero di carta
nl: Kaart nummer
pt_pt: Número do Cartão

# expiry_date_label
source: Expiry date
es: Fecha de caducidad
fr: Date d'expiration
it: Data di scadenza
nl: afloop datum
pt_pt: Data de Expiração

# start_date_label
source: Start date
es: Fecha de comienzo
fr: Date d'émission
it: Data inizio
nl: start datum
pt_pt: Data de Validade

# issue_number_label
source: Issue number
es: Número de expedición
fr: Numéro d'émission
it: Numero di emissione
nl: issue nummer
pt_pt: Número de Expedição

# date_hint
source: MM/YY
fr: MM/AA
it: MM/AA
nl: MM/JJ

source: Add card
es: Añadir tarjeta
fr: Ajouter une carte
it: Aggiungi carta
nl: Voeg kaart toe
pt_pt: Adicionar Cartão

source: Check expiry date
es: Compruebe la fecha de caducidad
fr: Vérifiez la date d'expiration
it: Controlla data di scadenza
nl: Check afloop datum
pt_pt: Confirmar data de expiração

source: Check start date
es: Compruebe la fecha de comienzo
fr: Vérifiez la date d'émission
it: Controlla data inizio
nl: Check start datum
pt_pt: Confirmar data de validade

source: Check card number
es: Comprobar número de tarjeta
fr: Vérifiez le numéro de carte
it: Controlla numero di carta
nl: Check kaart nummer
pt_pt: Confirmar número do cartão

source: Processing payment...
es: Procesando pago
fr: Paiement en cours
it: Pagamento in corso
nl: Betaling verwerken
pt_pt: Processando Pagamento

source: Long card number
es: Número largo de la tarjeta
fr: Numéro de carte long
it: Numero carta
nl: Lang kaart nummer
pt_pt: Número grande do cartão

source: Security code
es: Código de seguridad
fr: Code de sécurité
it: Codice di sicurezza
nl: Veiligheidscode
pt_pt: Código de Segurança

# issue_number_front_of_card
source: Issue number on front of card
es: Número de expedición en la parte delantera de su tarjeta
fr: Numéro d'émission au recto
it: Numero di emissione
nl: Issue nummer op de voorkant van de kaart
pt_pt: Número de Expedição na frente do cartão

source: Adding card...
es: Añadiendo tarjeta...
fr: Ajout de carte en cours
it: Inserimento della carta in corso
nl: kaart toevoegen
pt_pt: Adicionando cartão

source: Redirecting...
es: Redirigiendo
fr: Redirection
it: Reindirizzamento
nl: redirecten
pt_pt: Redirecionando

source: Authentication
es: Autenticación
it: Autenticazione
nl: Authoriseren
pt_pt: Autorizando

source: Verifying card
es: Verificando tarjeta
fr: Vérification de carte en cours
it: Verifica carta in corso
nl: Kaart bevestigen
pt_pt: Verificando cartão

# please_reenter_the_card_security_code
source: Re-enter security code
es: Por favor, vuelva a introducir el código de seguridad
fr: Veuillez saisir à nouveau le code de sécurité de la carte
it: Si prega di reinserire il codice di sicurezza della carta
nl: Kaart security code nogmaals toevoegen aub
pt_pt: Por favor, insira novamente o código de segurança do cartão

# secure_server_transmission
source: Your card details are encrypted using SSL before transmission to our secure payment service provider. They will not be stored on this device or on our servers.
es: Los detalles de su tarjeta son encriptados usando SSL antes de su transmisión a nuestro procesador de pagos seguro. No se almacenarán en su dispositivo ni en nuestros servidores.
fr: Vos informations de paiement sont encryptées par SSL avant transfert vers notre prestataire de paiements sécurisés. Aucune information ne sera conservée sur cet appareil ou sur nos serveurs.
it: Server sicuro: i dettagli della tua carta sono criptati mediante SSL prima di venire trasmessi al nostro processore di pagamento. Non verranno memorizzati su questo dispositivo o sui nostri server
nl: uw kaartgegevens worden gecodeerd met SSL voor de transmissie naar onze beveiligde betalingsdienstaanbieder. Ze worden niet opgeslagen op dit apparaat of op onze servers.
pt_pt: Seu cartão é encriptado usando SSL antes da transmissão ao nosso provedor de serviços de pagamento seguro. Ele não será salvo nesse dispositivo ou em nossos servidores.

# united_kingdom
source: UK
es: Reino Unido
fr: Royaume-Uni
it: Regno Unito
nl: VK
pt_pt: Reino Unido

# united_states
source: USA
es: Estados Unidos
fr: Etats-Unis
it: Stati Uniti
nl: VS
pt_pt: Estados Unidos

# other_country
source: Other
es: Otro
fr: Autre
it: Altro
nl: Anderen
pt_pt: Outros

source: Enter name
fr: Entrez le nom
it: Inserire nome
nl: Naam
pt_pt: Insira o nome

# select_bank
source: Select %@ as your iDEAL bank
es: Seleccione %@ como su banco iDEAL
fr: Sélectionner une banque iDEAL
it: Seleziona banca iDEAL
nl: Selecteer iDEAL bank
pt_pt: Selecione %@ como seu banco iDEAL

# date_format
source: MM/yy
fr: MM/aa
it: MM/aa
nl: MM/JJ

source: iDEAL Transaction
fr: Paiement iDEAL
it: Pagamento iDEAL
nl: iDEAL transactie
pt_pt: Transação iDEAL

source: Selected bank:
fr: Banque sélectionnée :
it: Banca selezionata:
nl: Selecteer bank:
pt_pt: Banco selecionado:

source: Select iDEAL bank
fr: Banque iDEAL sélectionnée :
it: Seleziona banca iDEAL
nl: Selecteer iDEAL bank
pt_pt: Selecione o banco iDEAL

source: Name
fr: Nom
it: Nome
nl: Naam
pt_pt: Nome

source: Secure server:
es: Servidor seguro:
fr: Serveur sécurisé : Vos informations de paiement sont encryptées par SSL avant transfert vers notre prestataire de paiements sécurisés. Aucune information ne sera conservée sur cet appareil ou sur nos serveurs.
it: Server sicuro:
nl: Beveiligde server
pt_pt: Servidor de Segurança

source: Payment Method
es: Metodo de pago
fr: Méthode de paiement
it: Metodo di pagamento
nl: Betaal wijze
pt_pt: Método de Pagamento

# select_payment_method
source: Please select from one of the payment methods listed below:
es: Por favor, seleccione uno de los siguientes métodos de pago:
fr: Veuillez sélectionner une méthode de paiement ci-dessous :
it: Si prega di selezionare un metodo di pagamento fra quelli disponibili:
nl: Selecteer een betaalwijze
pt_pt: Por favor selecione um dos métodos de pagamento abaixo:

source: Card Payment
es: Pago con tarjeta
fr: Paiement par carte
it: Pagamento con carta
nl: Kaart betaling
pt_pt: Pagamento em cartão

# unable_to_process_request_error_desc
source: Sorry, we're currently unable to process this request.
es: Lo sentimos, actualmente no podemos procesar esta solicitud.
fr: Désolé, nous ne somme pas en mesure de traiter cette requête pour le moment.
it: Siamo spiacenti, ma al momento non è possibile elaborare la richiesta
nl: Sorry, wij kunnen op het moment uw betaling niet verwerken
pt_pt: Desculpe, nós não podemos processar essa solicitação.

# unable_to_process_request_error_title
source: Unable to process
es: No se puede procesar
fr: Impossible de traiter la requête
it: Impossibile eseguire l'operazione
nl: Verwerken niet mogelijk
pt_pt: Incapaz de Processar

# error_request_failed
source: The request responded without data
es: La solicitud respondió sin datos.
fr: La requête n'a pas renvoyé de données
it: La richiesta ha risposto senza dati
nl: Het verzoek antwoorde zonder data
pt_pt: A solicitação respondeu sem dados

# error_payment_method_missing
source: The payment method (card details, token or PKPayment) has not been set for a transaction that requires it (custom UI)
es: El método de pago (detalles de la tarjeta, token o PKPayment) no se ha configurado para una transacción que lo requiere (IU personalizada)
fr: Le moyen de paiement (détails de votre carte, token ou PKPayment) n'a pas été configuré pour une transaction qui le nécessite (IU personalisée)
it: Il metodo di pagamento (dettagli carta, token o pkpayment) non è stato selezionato per per la transazione che lo richiede (UI personalizzata)
nl: De betaal methode (kaart details, token of PKPayment) is niet bevestigd voor een transactie waarbij dit benodigd is (custom UI)
pt_pt: O método de pagamento (detalhes do cartão, Token ou PKPagamento) não foi configurado para uma transação que requer (UI customizada)

# error_amount_missing
source: The amount has not been set for a transaction that requires it (custom UI)
es: El importe no se ha establecido para una transacción que lo requiere (IU personalizada)
fr: Le montant n'a pas été configuré pour une transaction qui le nécessite (IU personalisée)
it: L'importo non è stato selezionato per la transazione che lo richiede (UI personalizzata)
nl: Het bedrag is niet bevestigd voor een transactie waarbij dat nodig is (custom UI)
pt_pt: O valor não foi configurado para uma transação que requer (UI customizada)

# error_reference_missing
source: The reference has not been set for a transaction that requires it (custom UI)
es: La referencia no se ha establecido para una transacción que lo requiere (IU personalizada)
fr: La référence n'a pas été configuré pour une transaction qui le nécessite (IU personalisée)
it: Il riferimento non è stato selezionato per la transazione che lo richiede (UI personalizzata)
nl: De referentie is niet bevestigd voor een transactie waarbij dat benodigd is (Custom UI)
pt_pt: A referência não foi configurada para uma transação que requer (UI customizada)

# error_response_parse_error
source: An error with a response from the backend API
es: Un error con una respuesta de la API de servidor
fr: Une erreur dans la réponse de l'API backend
it: Un errore con la risposta dall'API del back end
nl: Een fout in het antwoord van de backend API
pt_pt: Um erro com a resposta do API do servidor

# error_user_did_cancel
source: Received when user cancels the payment journey
es: Recibido cuando el usuario cancela la sesión de pago
fr: Reçu quand l'utilisateur annule le paiement
it: Ricevuto quando l'utente esce dal processo di pagamento
nl: Ontvangen wanneer een gebruiker de betaal journey afbreekt
pt_pt: Recebido quando o usuário concela o pagamento

# error_parameter_error
source: A parameter entered into the dictionary (request body to Judo API) is not set
es: Un parámetro ingresado en el diccionario (cuerpo de solicitud a la API de Judo) no está configurado
fr: Un paramètre inséré dans le dictonnaire (corps de la requête effectuée à l'API de Judo) n'est pas configuré
it: Il parametro inserito nel dizionario (request body a Judo API) non è selezionato
nl: Een parameter in het woordenboek (verzoek body naar Judo API) is niet opgezet
pt_pt: Um parâmetro inserido no dicionário (pedido corpo ao API da Judo) não está configurado

# error_failed_3DS_request
source: After receiving the 3DS payload, when the payload has faulty data, the WebView fails to load the 3DS Page or the resolution page
es: Después de recibir la carga útil 3DS, cuando la carga útil tiene datos defectuosos, WebView no puede cargar la página 3DS o la página de resolución
fr: Après avoir reçu le payload 3DS, quand le payload contient des données erronées, la vue Web ne parvient pas à charger la page 3DS ou la page de résultats
it: Dopo aver ricevuto il payload 3DS, quando il payload contiene dati errati, WebView non riesce a caricare la pagina 3DS o la pagina di risoluzione
nl: Na het ontvangen van de 3DS payload, als de payload foute data heeft, the WebView kan de 3DS pagina of resolutie pagina niet laden
pt_pt: Depois de receber a carga útil do 3DS, quando a carga útil tem dados defeituosos, a WebView falha em carregar a página 3DS ou a página de resolução

# error_jailbroken_device_disallowed
source: The device the code is currently running is jailbroken. Jailbroken devices are not allowed when instantiating a new Judo session
es: El dispositivo que el código está ejecutando actualmente es jailbroken. Los dispositivos jailbroken no están permitidos cuando se crea una instancia de una nueva sesión de Judo
fr: L'appareil sur lequel le code est executé est jailbreaké. Les appareils jailbreakés ne sont pas autorisés pour la création d'une nouvelle session Judo.
it: Il dispositivo è jailbroken. I dispositivi jailbroken non sono consentiti durante l'istanza di una nuova sessione di Judo
nl: Het toestel waarop de code loopt is jailbroken. Jailbroken toestellen zijn niet toegestaan een nieuwe Judo sessie te starten
pt_pt: O dispositivo que o código está executando está Jailbroken, dispositivos jailbroken não são permitidos quando se cria uma instância de uma nova sessão da Judo

# error_3DS_request
source: Error when routing to 3DS
es: Error al enrutar a 3DS
fr: Erreur lors du routage 3DS
it: Errore durante il routing a 3DS
nl: Fout tijdens routing naar 3DS
pt_pt: Erro ao rotear para 3DS

# error_underlying_error
source: An error in the iOS system with an enclosed underlying error
es: Un error en el sistema iOS con un error subyacente adjunto
fr: Une erreur dans le système iOS avec une erreur sous-jacente
it: Un errore nel sistema iOS con un errore sottostante incluso
nl: Een fout in het IOS systeem met toegevoegde onderliggende fout
pt_pt: Um erro no sistema iOS com um erro subjacente

# error_transaction_declined
source: A transaction that was sent to the backend returned declined
es: Una transacción que se envió al servidor ha vuelto rechazada.
fr: Une transaction transmise au backend a été déclinée
it: La transazione trasmessa al back end è stata declinata
nl: Een transacite is verzonden naar de backend maar is niet goed gekeurd
pt_pt: A transação que foi enviada ao back-end retornou recusada

# error_checksum_missing_title
source: Checksum missing
fr: Le checksum est manquant
it: Checksum mancante
nl: Checksum niet aanwezig
pt_pt: Soma de verificação ausente

# error_checksum_missing_description
source: No checksum parameter present in iDEAL redirect URL
fr: Paramètre de checksum manquant dans l'URL de redirection iDEAL
it: Parametro checksum non presente nell' iDEAL URL redirect
nl: Geen checksum parameter aanwezig in iDEAL redirect URL
pt_pt: Nenhum parâmetro de soma de verificação presente no URL de redirecionamento do iDEAL

# error_timeout_title
source: Request has timed out
fr: La requête a expiré
it: La richiesta è scaduta!
nl: Verzoek is timed out
pt_pt: A solicitação expirou

# error_timeout_description
source: Request did not complete in the specified time
fr: Lq requête n'a pas abouti dans le temps imparti
it: L'operazione non è stata completata nel tempo a disposizione
nl: Verzoek is niet afgerond binnen de gestelde tijd
pt_pt: A solicitação não foi concluída no tempo especificado

# error_card_not_supported
source: We do not accept %@
es: No aceptamos %@
fr: Nous n'acceptions pas %@
it: %@ non accettata
nl: Wij accepteren geen %@
pt_pt: Nós não aceitamos %@

source: Add
es: Añadir
fr: Ajouter
it: Aggiungi
nl: Toevoegen
pt_pt: Adicionar

source: Back
es: Atrás
fr: Retour
it: Indietro
nl: Terug
pt_pt: Atrás

source: Refund
es: Reembolso
fr: Remboursement
it: Rimborso
nl: Terug storting
pt_pt: Reembolso

source: Check Card
fr: Vérifier la care
it: Controllare carta
nl: Check kaart
pt_pt: Verifique o cartão

source: Verifying payment
es: Verificando pago
fr: Paiement en cours de vérification
it: Verifica pagamento in corso
nl: Betaal wijze verifieren
pt_pt: Verificando Pagamento

source: Canada
es: Canadá
pt_pt: Canadá
